; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v6)
		(pred_5 ?v1)
		(pred_3 ?v8)
		(pred_4 ?v8)
		(pred_1 ?v1 ?v8)
		(pred_6)
		(pred_2 ?v1))

   (:action op_2
       :parameters  (?v7 ?v3)
       :precondition (and (not-eq ?v7 ?v3) 
                          (pred_3 ?v7) (pred_3 ?v3) (pred_4 ?v7))
       :effect (and  (pred_4 ?v3)
		     (not (pred_4 ?v7))))


   (:action op_3
       :parameters (?v4 ?v2)
       :precondition  (and  (pred_5 ?v4) (pred_3 ?v2)
			    (pred_1 ?v4 ?v2) (pred_4 ?v2) (pred_6))
       :effect (and (pred_2 ?v4)
		    (not (pred_1 ?v4 ?v2)) 
		    (not (pred_6))))

   (:action op_1
       :parameters  (?v4  ?v2)
       :precondition  (and  (pred_5 ?v4) (pred_3 ?v2)
			    (pred_2 ?v4) (pred_4 ?v2))
       :effect (and (pred_1 ?v4 ?v2)
		    (pred_6)
		    (not (pred_2 ?v4)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_01 obj_04 
          obj_02 obj_05 
)
(:init
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_04)
(pred_5 obj_02)
(pred_5 obj_05)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_6)
(pred_1 obj_02 obj_04)
(pred_1 obj_05 obj_01)
(pred_4 obj_04)
)
(:goal
(and
(pred_1 obj_02 obj_01)
(pred_1 obj_05 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_02 obj_01) (pred_4 obj_03))
    (sometime-before  (pred_1 obj_05 obj_04) (pred_4 obj_03))
  )
)
)

; plan
1. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02 obj_04) (pred_6)
   added: (pred_2 obj_02)
   goals met: 0 of 2
2. (op_2 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 0 of 2
3. (op_1 obj_02 obj_03)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_03) (pred_6)
   goals met: 0 of 2
4. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_01)
   goals met: 0 of 2
5. (op_3 obj_05 obj_01)
   deleted: (pred_1 obj_05 obj_01) (pred_6)
   added: (pred_2 obj_05)
   goals met: 0 of 2
6. (op_2 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_04)
   goals met: 0 of 2
7. (op_1 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_1 obj_05 obj_04) (pred_6)
   goals met: 1 of 2
8. (op_2 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 1 of 2
9. (op_3 obj_02 obj_03)
   deleted: (pred_1 obj_02 obj_03) (pred_6)
   added: (pred_2 obj_02)
   goals met: 1 of 2
10. (op_2 obj_03 obj_01)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_01)
   goals met: 1 of 2
11. (op_1 obj_02 obj_01)
   deleted: (pred_2 obj_02)
   added: (pred_1 obj_02 obj_01) (pred_6)
   goals met: 2 of 2
